Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: But this type of class comes with some limitations: all fields needs to be initialized at construction time or be marked as nullable, and the generated constructor needs to have as parameters all the fields of the data class.
ja_jp: しかし、このクラスの型はいくつかの制限があります。また、生成時に初期化される全てのフィールドは nullable としてマークされ、生成されたコンストラクタは、データクラスのすべてのフィールドをパラメータとして持つ必要があります。

source: But today, I promised you flamegraphs. I know you're all excited about them. Let's get to it!
ja_jp: しかし今日は、皆さんが楽しみにしているフレームグラフをお約束しました。さあ、本題に入りましょう！

source: But what about containerized deployment you ask? Well, once your shiny new GUI app is ready for primetime there are some last adjustments that we need to build runnable jars and images.
ja_jp: しかし、コンテナを使ったデプロイについてはどうでしょうか？新しいGUIアプリが完成したら、実行可能なjarやイメージを作成するために、いくつかの調整が必要になります。

source: But what about production? You won't want to use Dev Services in production. In fact, Quarkus only starts Dev Services in dev and test modes.
ja_jp: しかし、実稼働環境ではどうでしょうか? 実稼働環境では Dev Services を使用したくないはずです。 実際、Quarkus は開発モードとテストモードでのみ Dev Services を起動します。

source: But what about propagating access tokens to some custom services ? It is very easy to achieve in Quarkus, both for the authorization code and bearer token flows. All you need to do is to create a REST Client interface for calling the service requiring a Bearer token access and annotate it with `@AccessToken` and the access token arriving to the front-end endpoint as the Auth0 Bearer access token or acquired by Quarkus after completing the Auth0 authorization code flow, will be propagated to the target microservice. This is as easy as it can get.
ja_jp: しかし、アクセストークンを一部のカスタムサービスに伝播させる場合はどうでしょうか。Quarkus では、認可コードフローとベアラートークンフローの両方で非常に簡単にこれを実現できます。ベアラートークンアクセスを必要とするサービスを呼び出すための REST クライアントインターフェイスを作成し、それにアノテーション `@AccessToken` を付けるだけで、Auth0 ベアラーアクセストークンとしてフロントエンドエンドポイントに到着するアクセストークン、または Auth0 認可コードフローの完了後に Quarkus が取得したアクセストークンが、ターゲットマイクロサービスに伝播されます。これ以上簡単にはならないぐらい簡単です。

source: But what if you want something _really_ easy? At this point, things get harder. We created a second version of the scripts which are optimised for simplicity. They use only familiar tools, and don't attempt process isolation. Because of this, they can be run on both Mac and Linux, and, with the right terminal, Windows. The results need to be treated with caution; laptop power management can cause all sorts of wild effects, and if the load is too much or too little, you might end up measuring a bottleneck which has nothing to do with Quarkus or Spring. We're planning another blog (or six!) on how to avoid the most common problems, and how to tell if you're measuring what you think you are.
ja_jp: しかし、 _本当に_ 簡単なものが欲しい場合はどうでしょう？この時点から、物事は難しくなります。私たちは、シンプルさを追求したスクリプトの第2バージョンを作成しました。これらは馴染みのあるツールのみを使用し、プロセス分離は試みません。そのため、MacとLinuxの両方、そして適切なターミナルがあればWindowsでも実行できます。ただし、結果は注意して扱う必要があります。ラップトップの電源管理はあらゆる種類の奇妙な影響を引き起こす可能性があり、負荷が多すぎたり少なすぎたりすると、QuarkusやSpringとは関係のないボトルネックを測定してしまう可能性があります。最も一般的な問題を回避する方法や、測定しているものが自分が考えているものかどうかを判断する方法について、別のブログ（または6つ！）を計画しています。

source: But while they share the same code, Quarkus does configure some components automatically and inject custom implementations for some extension points; this should be transparent and useful but if you're an expert of Hibernate Reactive you might want to know what is being done.
ja_jp: しかし、両者は同じコードを共有していますが、Quarkusはいくつかのコンポーネントを自動的に設定し、いくつかの拡張ポイントにカスタム実装を注入しています。

source: But while they share the same code, Quarkus does configure some components automatically and injects custom implementations for some extension points; this should be transparent and useful but if you're an expert of Hibernate you might want to know what is being done.
ja_jp: ただし、同じコードを共有しているものの、Quarkus は一部のコンポーネントを自動的に設定し、いくつかのエクステンション ポイントに対してカスタム実装を注入します。これは透過的で便利なはずですが、Hibernate のエキスパートであれば、 何が行われているかを知りたいかもしれません。

source: But you can also define any number of repositories for your custom operations within your entity:
ja_jp: しかし、エンティティ内でカスタム操作のための任意の数のリポジトリを定義することもできます。

source: But you may be wondering where the URL is configured as it’s not in the code. Remember, it must not be hard-coded because the URL likely depends on the environment. The URL is configured in the application configuration:
ja_jp: しかし、URLがコードに含まれていないため、どこで設定されているのか疑問に思うかもしれません。URLは環境に依存する可能性が高いので、ハードコーディングしてはいけないことを覚えておいてください。URLの設定は、アプリケーションの設定で行います。

source: But, after so many years and lines of code written, how can we move those Java workloads to this set of new paradigms? The Red Hat Modernization and Migration Solutions team is here to help by providing the http://red.ht/mta[Migration Toolkit for Applications] (MTA), a tool that simplifies, and reduces the effort required to take this step. As a matter of fact, just like Java, MTA is not a new tool but one that has been evolving over time.
ja_jp: しかし、何年もかけて何行ものコードを書いた後、これらのJavaワークロードをこの一連の新しいパラダイムに移行するにはどうすればよいのでしょうか？Red HatのModernization and Migration Solutionsチームは、 link:http://red.ht/mta[Migration Toolkit for]Applications (MTA)というツールを提供することで、このステップに必要な労力を簡略化し、削減することを支援します。実は、Javaと同様にMTAも新しいツールではなく、時間をかけて進化してきたものなのです。

source: But, how would these events be encoded? The previous example using JSON is nice, but some protocols may want to leverage their own capabilities to transmit these metadata.
ja_jp: しかし、これらのイベントはどのようにエンコードされるのでしょうか?JSON を使った先ほどの例もいいですが、プロトコルによっては、独自の機能を活用してこれらのメタデータを送信したい場合もあるでしょう。

source: But, still no hot reload 😿.
ja_jp: しかし、やはりホットリロードはダメですね😿。

source: But, there is a catch. We need a way to write continuation-passing code. There are many ways of doing this. In Quarkus, we propose:
ja_jp: しかし、これには問題があります。継続パッシングのコードを書くための方法が必要なのです。これにはいろいろな方法があります。Quarkusでは、以下を提案しています:

source: But, wait a minute, what does that mean for my imperative APIs? Do I need to learn reactive programming to use Quarkus now? Let's be clear: **no**. This blog post will look at a few changes we made in RESTEasy reactive to make the transition smooth and transparent.
ja_jp: しかし、ちょっと待ってください。私が使っている命令型APIはどうなるのでしょうか？今のQuarkusを使うにはリアクティブプログラミングを学ぶ必要があるのでしょうか？はっきりさせておきましょう： *いいえ*。このブログ記事では、スムーズで透明性の高い移行を実現するためにRESTEasy reactiveに加えたいくつかの変更点をご紹介します。

source: But, what about streams? Generating a <em>server-sent event</em> response with Quarkus is just as simple:
ja_jp: しかし、ストリームについてはどうでしょうか？Quarkusで<em>server-sent event</em>レスポンスを生成するのは、次のようにとても簡単です。

source: By Category
ja_jp: カテゴリー:

source: By Version
ja_jp: バージョン:

source: By adding an interface and updating existing entities to implement it, we have effectively changed the schema. The updated schema will now include the new `Ally` type and `Character` interface.
ja_jp: インターフェイスを追加し、既存のエンティティを更新してそれを実装することで、事実上スキーマを変更したことになります。更新されたスキーマには、新しい型 `Ally` とインターフェース `Character` が含まれるようになりました。

source: By adding the `%prod.` profile prefix, you ensure that the data source properties are only observed by an application running in production mode.
ja_jp: `%prod.` プロファイル接頭辞を追加することで、データソースプロパティーが実稼働モードで実行されているアプリケーションによってのみ監視されるようになります。

source: By adding the second extension, you can use the reactive API in another part of your code - without needing to create a separate app.
ja_jp: 2つ目のエクステンションを追加することで、個別のアプリケーションを作成することなく、コードの別の部分で Reactive API を使用できます。

source: By adding these dependencies, we enable the generation of Kubernetes manifests each time we perform a build while also enabling the build of a container image using Jib. For example, following the execution of:
ja_jp: これらの依存関係を追加することで、ビルドを実行するたびに Kubernetes マニフェストの生成を可能にし、同時に Jib を使ったコンテナーイメージのビルドを可能にします。 たとえば、以下を実行した後、

source: By adding this method we have effectively changed the schema of the GraphQL API. Although the schema has changed the previous queries will still work. Since we only expanded the API to be able to retrieve the `Hero` data of the `Film`.
ja_jp: このメソッドを追加することで、GraphQL APIのスキーマが事実上変更されました。 スキーマが変更されたにもかかわらず、以前のクエリはそのまま動作します。 今回は、 `Film` の `Hero` のデータを取得できるようにAPIを拡張しただけですから。

source: By adding this property along with the rest of the container image properties of the previous section, the generated manifests will use the image `my.docker-registry.net/quarkus/demo-app:1.0`. The image is not the only thing that can be customized in the generated manifests, as will become evident in the following sections.
ja_jp: 前のセクションで説明したコンテナーイメージプロパティーと一緒にこのプロパティーを追加すると、生成されるマニフェストではイメージ `my.docker-registry.net/quarkus/demo-app:1.0` を使用するようになります。次のセクションで明らかになるように、生成されるマニフェストでカスタマイズできるのはイメージだけではありません。

source: By annotating the method with `@io.quarkus.deployment.annotations.Consume`, giving the class name of a <<empty-build-items,empty build item>>
ja_jp: メソッドに `@io.quarkus.deployment.annotations.Consume` のアノテーションを付け、 xref:empty-build-items[空のビルド項目] のクラス名を与えます。

source: By annotating the method with `@io.quarkus.deployment.annotations.Consume`, giving the class name of an <<empty-build-items,empty build item>>
ja_jp: メソッドに `@io.quarkus.deployment.annotations.Consume` アノテーションを付与し、 <<empty-build-items,empty build item>> のクラス名を指定します。

source: By annotating the method with `@io.quarkus.deployment.annotations.Produce`, giving the class name of a <<empty-build-items,empty build item>>
ja_jp: メソッドに `@io.quarkus.deployment.annotations.Produce` のアノテーションを付け、 xref:empty-build-items[空のビルド項目] のクラス名を与えます。

source: By annotating the method with `@io.quarkus.deployment.annotations.Produce`, giving the class name of an <<empty-build-items,empty build item>>
ja_jp: メソッドに `@io.quarkus.deployment.annotations.Produce` アノテーションを付与し、 <<empty-build-items,empty build item>> のクラス名を指定します。

source: By chaining a Kafka transaction with a Hibernate Reactive transaction you can send records to a Kafka transaction, perform database updates and commit the Kafka transaction only if the database transaction is successful.
ja_jp: Kafka トランザクションを Hibernate Reactive トランザクションとチェーンすることにより、Kafka トランザクションにレコードを送信し、データベースの更新を実行して、データベーストランザクションが成功した場合にのみ Kafka トランザクションをコミットすることができます。

source: By combining Quarkus Chicory with Google CEL-Go compiled to WebAssembly, we've created a Kubernetes-style CEL policy engine that runs entirely in Java.
ja_jp: Quarkus Chicory と、WebAssembly にコンパイルされた Google CEL-Go を組み合わせることで、完全に Java で動作する Kubernetes スタイルの CEL ポリシーエンジンを作成しました。

source: By contrast, native executable compilation has to cater for all possible execution paths when it compiles code offline since it does not know which are the hot or cold paths and cannot use the trick of planting a trap and recompiling if it is hit. For the same reason it cannot load the dice to ensure that code cache conflicts are minimized by co-locating hot paths adjacent. Native executable generation is able to remove some code because of the closed world hypothesis but that is often not enough to make up for all the benefits that profiling and runtime deopt & recompile provides to the JVM JIT compiler.
ja_jp: 一方、ネイティブ実行可能ファイルのコンパイルでは、オフラインでコードをコンパイルする際に、すべての可能な実行経路に対応しなければなりません。なぜならば、ホットパスやコールドパスがわからないため、罠を仕掛けて、それに当たったら再コンパイルするというようなトリックが使えないからです。同じ理由で、ホットパスを隣接して配置することでコードキャッシュの衝突を最小限に抑えるようなサイコロを積むこともできません。ネイティブ実行可能ファイルの生成は、閉じた世界の仮説により、いくつかのコードを削除することができますが、それだけでは、プロファイリングや実行時最適化解除＆再コンパイルがJVM JITコンパイラに提供するすべての利点を補うことはできません。

source: By convention `quarkus.native.additional-build-args-append` is meant to be defined at the command line (e.g. `-Dquarkus.native.additional-build-args-append=--verbose`), while `quarkus.native.additional-build-args` may be defined either at the command line or in your `application.properties`. Note that, any arguments included in `quarkus.native.additional-build-args-append` may override those included in `quarkus.native.additional-build-args`.
ja_jp: 慣例として、`quarkus.native.additional-build-args-append` はコマンドラインで定義することを目的としており (例: `-Dquarkus.native.additional-build-args-append=--verbose`)、`quarkus.native.additional-build-args` はコマンドラインまたは `application.properties` のいずれかで定義できます。`quarkus.native.additional-build-args-append` に含まれる引数は、`quarkus.native.additional-build-args` に含まれる引数よりも優先される場合があることに注意してください。

source: By convention the deployment time artifact has the `-deployment` suffix, and the runtime artifact has no suffix (and is what the end user adds to their project).
ja_jp: 慣例として、デプロイメント時のアーティファクトには `-deployment` というサフィックスが付き、ランタイムアーティファクトにはサフィックスは付きません (これはエンドユーザーがプロジェクトに追加するものです)。

source: By convention, the Docker clients attempt to connect to the service specified by URL configured in the `DOCKER_HOST` environment variable, so this variable needs to be configured to point to the Unix socket that the Podman service will be listening on:
ja_jp: 通常、Dockerクライアントは、 `DOCKER_HOST` 環境変数で設定されたURLで指定されたサービスに接続しようとするため、この変数は、PodmanサービスがリッスンするUnixソケットを指すように設定する必要があります。

source: By convention, the deployment module has the `-deployment` suffix (`greeting-extension-deployment`).
ja_jp: 決まりとして、配置モジュールのサフィックスは `-deployment` (`greeting-deployment`) です。

source: By convention, the enclosing class name and method names are used to locate the template. In this particular case, we will use the `src/main/resources/templates/MailingResource/hello.html` and `src/main/resources/templates/MailingResource/hello.txt` templates to create the message body.
ja_jp: 規約では、テンプレートの位置を特定するために、囲んでいるクラス名とメソッド名が使用されます。この例では、 `src/main/resources/templates/MailingResource/hello.html` と `src/main/resources/templates/MailingResource/hello.txt` のテンプレートを使ってメッセージ本文を作成します。

source: By convention, the enclosing class name and the record name are used to locate the template. In this particular case, we will use the `src/main/resources/templates/MailingResource/hello.html` and `src/main/resources/templates/MailingResource/hello.txt` templates to create the message body.
ja_jp: 規約では、テンプレートを見つけるために、クラス名とレコード名が使用されます。このケースでは、 `src/main/resources/templates/MailingResource/hello.html` と `src/main/resources/templates/MailingResource/hello.txt` のテンプレートを使用してメッセージ本文を作成します。

source: By convention, the runtime module doesn't have a suffix (and thus is named `greeting-extension`) as it is the artifact exposed to the end user.
ja_jp: 決まりとして、実行時モジュールはエンドユーザーに公開されるアーティファクトであるため、接尾辞 (`greeting`) を持たない。

source: By convention, the runtime module has no suffix (`greeting-extension`) as it is the artifact exposed to the end user.
ja_jp: 決まりとして、実行時モジュールはエンドユーザーに公開されるアーティファクトであるため、接尾辞 (`greeting`) を持たない。

source: By convention, they are discovered by adding a `/.well-known/openid-configuration` path to the configured `quarkus.oidc.auth-server-url`.
ja_jp: 規約により、 `quarkus.oidc.auth-server-url` で設定することで `/.well-known/openid-configuration` のパスを追加することで検出されます。

source: By default Protobuf schemas generated this way will be registered by this extension when the client first connects. However, it might be required to handle the registration manually as a schema may evolve over time when used in production, so you can disable this from occurring by configuring the `quarkus.infinispan-client.use-schema-registration` to `false`.
ja_jp: デフォルトでは、この方法で生成されたProtobufスキーマは、クライアントが最初に接続したときにこのエクステンションによって登録されます。 しかし、運用中にスキーマが時間と共に進化する可能性があるため、手動で登録を処理する必要があるかもしれません。そのため、 `quarkus.infinispan-client.use-schema-registration` を `false` に設定することで、これが発生しないようにできます。

source: By default Quarkus automatically detects the container runtime. If you want to explicitely select the container runtime, you can do it with:
ja_jp: デフォルトでは、Quarkusはコンテナーランタイムを自動的に検出します。コンテナーランタイムを明示的に選択したい場合は、次のようにします。

source: By default Quarkus does what we call proactive authentication. This means that if an incoming request has a credential then that request will always be authenticated (even if the target page does not require authentication).
ja_jp: デフォルトでは、Quarkusはプロアクティブ認証と呼ばれる認証を行います。これは、受信したリクエストにクレデンシャルがある場合、そのリクエストは常に認証されます(ターゲットページが認証を必要としない場合でも)。

source: By default Quarkus lets Testcontainers expose random ports for Grafana and OTel, but you can force the usage of user-side fixed ports via setting the ports yourself - but then be aware of port conflicts.
ja_jp: デフォルトでは、Quarkus は Testcontainers に Grafana と OTel のランダムなポートを公開させますが、ポートを自分で設定することで、ユーザー側で固定ポートを使用するように強制できます。ただし、その場合はポート競合に注意してください。

source: By default Quarkus omits the namespace in the generated manifests, rather than enforce the `default` namespace. That means that you can apply the manifest to your chosen namespace when using `kubectl`, which in the example below is `test`:
ja_jp: デフォルトでは、Quarkusは生成されたマニフェストにおいて、 `default` 名前空間を強制するのではなく、名前空間を省略します。つまり、 `kubectl` を使用する際に、選択したネームスペースにマニフェストを適用することができます。以下の例では、 `test` となっています:

source: By default Quarkus will automatically generate a main method, that will bootstrap Quarkus and then just wait for shutdown to be initiated. Let's provide our own main method:
ja_jp: デフォルトでは、Quarkusは自動的にメインメソッドを生成し、Quarkusを起動し、シャットダウンが開始されるのを待つだけです。独自のメインメソッドを追加してみましょう:

source: By default Quarkus will restrict the use of JNDI within an application, as a precaution to try and mitigate any future vulnerabilities similar to log4shell. Because the `mongo+srv` protocol often used to connect to MongoDB requires JNDI, this protection is automatically disabled when using the MongoDB client extension.
ja_jp: デフォルトでは、Quarkusはアプリケーション内でのJNDIの使用を制限します。これは、log4shellのような将来的な脆弱性を軽減するための予防策です。MongoDBへの接続によく使われる `mongo+srv` プロトコルはJNDIを必要とするため、MongoDBクライアントエクステンションを使用すると、この保護機能は自動的に無効になります。

source: By default Quarkus will restrict the use of JNDI within an application, as a precaution to try and mitigate any future vulnerabilities similar to log4shell. Because LDAP based auth requires JNDI this protection will be automatically disabled.
ja_jp: デフォルトでは、Quarkusはアプリケーション内でのJNDIの使用を制限します。これは、log4shellのような将来的な脆弱性を軽減するための予防措置です。LDAPベースの認証はJNDIを必要とするため、この保護は自動的に無効になります。

source: By default Quarkus will serve content from under the root context. If you want to change this you can use the `quarkus.http.root-path` config key to set the context path.
ja_jp: デフォルトでは、Quarkus はルートコンテキストの下からコンテンツを提供します。これを変更したい場合は、 `quarkus.http.root-path` 設定キーを使用してコンテキストパスを設定することができます。

source: By default Spring stereotype annotations are singleton beans
ja_jp: デフォルトでは、SpringのステレオタイプアノテーションはシングルトンBeanです

source: By default all JSON‑RPC methods are visible in the Dev UI. Only methods with descriptions are exposed via Dev MCP. You can override this behaviour with the `@JsonRpcUsage` annotation. Pass one or both of the `Usage` enums (`DEV_UI`, `DEV_MCP`) to control where a method is exposed.
ja_jp: デフォルトでは、すべての JSON‑RPC メソッドが Dev UI に表示されます。説明のあるメソッドのみが Dev MCP 経由で公開されます。この動作は `@JsonRpcUsage` アノテーションで上書きできます。`Usage` 列挙型 (`DEV_UI`、`DEV_MCP`) の一方または両方を渡して、メソッドをどこに公開するかを制御します。

source: By default all log levels are exported.
ja_jp: デフォルトでは、すべてのログレベルがエクスポートされます。

source: By default entities are cached in regions named after their fully qualified name, e.g. `org.acme.Country`.
ja_jp: デフォルトでは、エンティティは、その完全修飾名を冠した領域（例えば、 `org.acme.Country`）にキャッシュされます。

source: By default in `dev` and `test` modes, Hibernate ORM, upon boot, will read and execute the SQL statements in the `/import.sql` file (if present). You can change the file name by changing the property `quarkus.hibernate-orm.sql-load-script` in `application.properties`.
ja_jp: `dev` および `test` モードのデフォルトでは、Hibernate ORM は起動時に `/import.sql` ファイル内の SQL 文を読み込んで実行します (存在する場合)。 `application.properties` のプロパティ `quarkus.hibernate-orm.sql-load-script` を変更することで、ファイル名を変更できます。

source: By default it is also possible to use it for read-only operations without a transaction when in a request scope, but this can be disabled by setting `quarkus.hibernate-orm.request-scoped.enabled` to `false`.
ja_jp: デフォルトでは、リクエストスコープ内であればトランザクションなしで読み取り専用操作に使用することも可能ですが、 `quarkus.hibernate-orm.request-scoped.enabled` を `false` に設定することでこの機能を無効にできます。

source: By default test output is filtered and not displayed on the console, so that test output and dev mode output is not interleaved. Enabling test output will print output to the console when tests are run. Even when output is disabled the filtered output is saved and can be viewed in the Dev UI.
ja_jp: デフォルトでは、テスト出力はフィルタリングされ、コンソールには表示されないので、テスト出力とdevモードの出力が混在することはありません。テスト出力を有効にすると、テストが実行されたときに出力がコンソールに表示されます。出力を無効にした場合でも、フィルタリングされた出力は保存され、開発UIで見ることができます。

source: By default tests should just work with xref:dev-services.adoc[Dev Services], however from some use cases you may need access to the automatically configured properties in your tests.
ja_jp: デフォルトでは、テストは xref:dev-services.adoc[Dev Services] でのみ機能するはずですが、一部のユースケースでは、テストで自動的に設定されたプロパティーにアクセスする必要がある場合があります。

source: By default the Keycloak page can be used to support the development of a xref:security-openid-connect.adoc[Quarkus OIDC service application].
ja_jp: デフォルトでは、Keycloak ページを使用して、xref:security-openid-connect.adoc[Quarkus OIDC サービスアプリケーション] の開発をサポートできます。

source: By default the `@InjectMock` annotation can be used for any normal CDI scoped bean (e.g. `@ApplicationScoped`, `@RequestScoped`). Mocking `@Singleton` beans can be performed by setting the `convertScopes` property to true (such as `@InjectMock(convertScopes = true`). This will convert the `@Singleton` bean to an `@ApplicationScoped` bean for the test.
ja_jp: デフォルトでは、 `@InjectMock` アノテーションは、通常の CDI スコープの Bean (たとえば、 `@ApplicationScoped`、 `@RequestScoped`) に使用できます。 `@Singleton` Bean のモッキングは、 `convertScopes` プロパティーを true (例: `@InjectMock(convertScopes = true`) に設定することで実行できます。これにより、テスト用に `@Singleton` Bean が `@ApplicationScoped` Bean に変換されます。

source: By default the `@QuarkusMain` with no name (i.e. the empty string) will be used, and if it is not present and `quarkus.package.main-class` is not specified then Quarkus will automatically generate a main class that just runs the application.
ja_jp: デフォルトでは、名前のない `@QuarkusMain` (つまり空文字列)が使用され、それが存在せず `quarkus.package.main-class` が指定されていない場合は、Quarkus はアプリケーションを実行するだけのメインクラスを自動的に生成します。

source: By default the `quarkus-grpc` extension relies on reactive programming model, in this guide we will follow reactive approach. Under the dependencies section of your `pom.xml` file replace the `quarkus-resteasy` dependency with:
ja_jp: デフォルトでは、 `quarkus-grpc` エクステンションモジュールはリアクティブプログラミングモデルに依存しています。 `pom.xml` ファイルの依存関係セクションで、 `quarkus-resteasy` の依存関係を次のように置き換えてください：

source: By default the authentication security constraints are enforced before the JAX-RS chain starts. Disabling the proactive authentication effectively shifts this process to the moment when the JAX-RS chain starts running thus making it possible to use JAX-RS `ExceptionMapper` to capture Quarkus Security authentication exceptions such as `io.quarkus.security.AuthenticationFailedException`, for example:
ja_jp: デフォルトでは、認証のセキュリティ制約は、JAX-RS チェーンが開始する前に実施されます。 プロアクティブ認証を無効にすると、このプロセスが JAX-RS チェーンの実行開始時点に事実上移行され、JAX-RS `ExceptionMapper` を使用して `io.quarkus.security.AuthenticationFailedException` などの Quarkus Security 認証例外をキャプチャできるようになります。 例：

source: By default the client will support keys and values of the following types: byte[], primitive wrappers (eg. Integer, Long, Double etc.), String, Date and Instant. User types require some additional steps that are detailed here. Let's say we have the following user classes:
ja_jp: デフォルトでは、クライアントは以下の型のキーとバリューをサポートします: byte[]、プリミティブラッパー(例: Integer、Long、Doubleなど)、String、Date、Instant。ユーザ型については、ここで詳しく説明される追加のステップが必要です。以下のようなユーザクラスがあるとします。

source: By default the generated native image configuration files are not used by subsequent native image building processes. This precaution is taken to avoid situations where seemingly unrelated actions have unintended consequences on the native executable produced, e.g. disabling randomly failing tests.
ja_jp: デフォルトでは、生成されたネイティブイメージ設定ファイルは、後続のネイティブイメージ構築プロセスでは使用されません。 一見関係のない操作が、生成されたネイティブ実行可能ファイルに意図しない影響を及ぼすのを防ぐために、この予防措置が取られています。 たとえば、ランダムに失敗するテストを無効にするなどです。
